# Datos del Titanic

In [2]:
import seaborn as sns

In [3]:
titanic = sns.load_dataset("titanic")

In [4]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:
titanic.shape

(891, 15)

In [6]:
titanic.survived.unique()

array([0, 1])

In [7]:
titanic.pclass.unique()

array([3, 1, 2])

In [8]:
titanic.sex.unique()

array(['male', 'female'], dtype=object)

In [9]:
titanic.age.unique()

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

In [10]:
import numpy as np
import pandas as pd

In [11]:
titanic['survived'] = pd.Categorical(titanic['survived'])

In [12]:
titanic['pclass'] = pd.Categorical(titanic['pclass'])

In [13]:
titanic['sex'] = pd.Categorical(titanic['sex'])

In [14]:
titanic['deck'] = pd.Categorical(titanic['deck'])

## Tablas de contingencia de una variable

### Frecuencias absolutas

In [15]:
tab = pd.crosstab(index = titanic['survived'],
                 columns = 'pasajeros')
tab

col_0     pasajeros
survived
0               549
1               342

In [16]:
type(tab)

pandas.core.frame.DataFrame

In [17]:
pd.crosstab(index = titanic['pclass'],
           columns = "pasajeros")

col_0   pasajeros
pclass
1             216
2             184
3             491

In [18]:
pd.crosstab(index = titanic['sex'],
           columns = "pasajeros")

col_0   pasajeros
sex
female        314
male          577

In [21]:
tab_c = pd.crosstab(index = titanic['deck'],
           columns = "count")
tab_c

col_0  count
deck
A         15
B         47
C         59
D         33
E         32
F         13
G          4

In [22]:
tab_c.sum()

col_0
count    203
dtype: int64

In [23]:
tab_c.shape

(7, 1)

In [24]:
tab_c.iloc[1:5]

col_0  count
deck
B         47
C         59
D         33
E         32

In [25]:
tab_c/tab_c.sum()

col_0     count
deck
A      0.073892
B      0.231527
C      0.290640
D      0.162562
E      0.157635
F      0.064039
G      0.019704

### Frecuencias relativas

In [26]:
tab_sex = pd.crosstab(index = titanic['sex'],
           columns = "pasajeros")
tab_sex

col_0   pasajeros
sex
female        314
male          577

In [27]:
tab_sex.sum()

col_0
pasajeros    891
dtype: int64

In [28]:
tab_sex/tab_sex.sum()

col_0   pasajeros
sex
female   0.352413
male     0.647587

In [29]:
tab_class = pd.crosstab(index = titanic['pclass'],
           columns = "pasajeros")
tab_class

col_0   pasajeros
pclass
1             216
2             184
3             491

In [30]:
tab_class.sum()

col_0
pasajeros    891
dtype: int64

In [31]:
tab_class/tab_class.sum()

col_0   pasajeros
pclass
1        0.242424
2        0.206510
3        0.551066

In [32]:
tab_s = pd.crosstab(index = titanic['survived'],
                 columns = 'pasajeros')
tab_s

col_0     pasajeros
survived
0               549
1               342

In [33]:
tab_s.sum()

col_0
pasajeros    891
dtype: int64

In [34]:
tab_s/tab_s.sum()

col_0     pasajeros
survived
0          0.616162
1          0.383838

## Tablas de contingencia de dos variable

### Frecuencias absolutas

In [36]:
survived_sex = pd.crosstab(index = titanic['survived'],
                          columns = titanic['sex'])
survived_sex.index = ["died", "survived"]
survived_sex

sex       female  male
died          81   468
survived     233   109

In [42]:
survived_class = pd.crosstab(index = titanic['survived'], 
                             columns = titanic['pclass'])
survived_class.index = ["murio", "sobrevivio"]
survived_class.columns = ["Primera", "Segunda", "Tercera"]
survived_class

            Primera  Segunda  Tercera
murio            80       97      372
sobrevivio      136       87      119

In [43]:
survived_class = pd.crosstab(index = titanic['survived'], 
                             columns = titanic['pclass'],
                            margins = True)
survived_class.index = ["murio", "sobrevivio","total_clase"]
survived_class.columns = ["Primera", "Segunda", "Tercera", "total_supervivencias"]
survived_class

             Primera  Segunda  Tercera  total_supervivencias
murio             80       97      372                   549
sobrevivio       136       87      119                   342
total_clase      216      184      491                   891

### Frecuencias relativas globales

In [44]:
survived_class/survived_class.loc["total_clase","total_supervivencias"]

              Primera   Segunda   Tercera  total_supervivencias
murio        0.089787  0.108866  0.417508              0.616162
sobrevivio   0.152637  0.097643  0.133558              0.383838
total_clase  0.242424  0.206510  0.551066              1.000000

### Frecuencias realativas marginales

In [48]:
survived_class/survived_class.loc["total_clase"] # divide por filas

             Primera   Segunda   Tercera  total_supervivencias
murio        0.37037  0.527174  0.757637              0.616162
sobrevivio   0.62963  0.472826  0.242363              0.383838
total_clase  1.00000  1.000000  1.000000              1.000000

In [49]:
survived_class.T

                      murio  sobrevivio  total_clase
Primera                  80         136          216
Segunda                  97          87          184
Tercera                 372         119          491
total_supervivencias    549         342          891

In [53]:
survived_class.T/survived_class["total_supervivencias"]

                         murio  sobrevivio  total_clase
Primera               0.145719    0.397661     0.242424
Segunda               0.176685    0.254386     0.206510
Tercera               0.677596    0.347953     0.551066
total_supervivencias  1.000000    1.000000     1.000000

In [56]:
survived_class.div(survived_class.loc["total_clase"], axis = 1) # Divisi√≥n por columnas

             Primera   Segunda   Tercera  total_supervivencias
murio        0.37037  0.527174  0.757637              0.616162
sobrevivio   0.62963  0.472826  0.242363              0.383838
total_clase  1.00000  1.000000  1.000000              1.000000

In [57]:
survived_class.div(survived_class["total_supervivencias"], axis = 0) # Divisi√≥n por filas

              Primera   Segunda   Tercera  total_supervivencias
murio        0.145719  0.176685  0.677596                   1.0
sobrevivio   0.397661  0.254386  0.347953                   1.0
total_clase  0.242424  0.206510  0.551066                   1.0

## Tablas multi dimensionales

### Frecuencias absolutas

In [59]:
surv_sex_class = pd.crosstab(index = titanic["survived"],
                            columns = [titanic["sex"], titanic["pclass"]])
surv_sex_class

sex      female         male
pclass        1   2   3    1   2    3
survived
0             3   6  72   77  91  300
1            91  70  72   45  17   47

In [60]:
surv_sex_class = pd.crosstab(index = titanic["survived"],
                            columns = [titanic["sex"], titanic["pclass"]],
                            margins = True)
surv_sex_class

sex      female          male            All
pclass        1   2    3    1    2    3
survived
0             3   6   72   77   91  300  549
1            91  70   72   45   17   47  342
All          94  76  144  122  108  347  891

In [61]:
surv_sex_class["female"]

pclass     1   2    3
survived
0          3   6   72
1         91  70   72
All       94  76  144

In [62]:
surv_sex_class["female"][1]

survived
0       3
1      91
All    94
Name: 1, dtype: int64

### Frecuencias relativas

#### Frecuencias relativas globales

In [71]:
surv_sex_class/surv_sex_class.sum()

sex         female                      male                           All
pclass           1         2     3         1         2         3
survived
0         0.015957  0.039474  0.25  0.315574  0.421296  0.432277  0.308081
1         0.484043  0.460526  0.25  0.184426  0.078704  0.067723  0.191919
All       0.500000  0.500000  0.50  0.500000  0.500000  0.500000  0.500000

#### Frecuencias relativas marginales

##### Por columnas

In [63]:
surv_sex_class/surv_sex_class.loc["All"] # Marginal por columnas

sex         female                     male                           All
pclass           1         2    3         1         2         3
survived
0         0.031915  0.078947  0.5  0.631148  0.842593  0.864553  0.616162
1         0.968085  0.921053  0.5  0.368852  0.157407  0.135447  0.383838
All       1.000000  1.000000  1.0  1.000000  1.000000  1.000000  1.000000

##### Por filas

In [72]:
surv_sex_class.div(surv_sex_class["All"], axis = 0) # Divisi√≥n por filas

sex         female                          male                      All
pclass           1         2         3         1         2         3
survived
0         0.005464  0.010929  0.131148  0.140255  0.165756  0.546448  1.0
1         0.266082  0.204678  0.210526  0.131579  0.049708  0.137427  1.0
All       0.105499  0.085297  0.161616  0.136925  0.121212  0.389450  1.0